cf_billing/Documents/энргПереносОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргПереносОплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргПроцентыПоРассрочке</xr:Item>
				<xr:Item>AccumulationRegister.энргОплатаУслуг</xr:Item>
				<xr:Item>AccumulationRegister.энргЗадолженностьПоРассрочке</xr:Item>
				<xr:Item>AccumulationRegister.энргНераспознаннаяОплатаФизЛица</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>InformationRegister.энргИсторияОплаты</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Источник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
								<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Приемник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсточникПоступления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОплатаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОплатаУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Documents/энргПереносОплаты/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Если ДополнительныеСвойства.свойство("ВосстановлениеПоследовательности") тогда
		Возврат;
	КонецЕсли;
	
	ГраницыПериода  		= Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Организация,Район,ПериодНачисления);
	
	НачалоПериодаРасчета	= ГраницыПериода.НачалоОП;
	КонецПериодаРасчета  	= ГраницыПериода.ЗавершениеОП-1;
		
	Ответственный 			= Пользователи.ТекущийПользователь();	
			
	энргПроведениеСервер.ПередЗаписьюОбъекта(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	энргПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	//СторнируемыеЗаписи 	= ПолучитьСторнируемыеЗаписи();
	НовыеЗаписи			= ПолучитьНовыеЗаписи();
	
	//ЗаписатьВРегистрэнргНераспознаннаяОплатаФизЛица(СторнируемыеЗаписи);		
	ЗаписатьНовыеЗаписиВРегистры(НовыеЗаписи);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ПолучитьСторнируемыеЗаписи()
//	Запрос = Новый Запрос;
//	Запрос.УстановитьПараметр("Организация", 		Организация);
//	Запрос.УстановитьПараметр("Район", 				Район);
//	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
//	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
//	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
//	Запрос.Текст = "ВЫБРАТЬ
//	|	&Организация КАК Организация,
//	|	&Район КАК Район,
//	|	&Период КАК Период,
//	|	энргПереносОплатыИсточник.ИсточникПоступления КАК ИсточникПоступления,
//	|	энргПереносОплатыИсточник.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
//	|	энргПереносОплатыИсточник.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
//	|	энргПереносОплатыИсточник.СуммаОплаты КАК СуммаОплаты,
//	|	энргПереносОплатыИсточник.ФИОПлательщика КАК ФИОПлательщика,
//	|	энргПереносОплатыИсточник.НазначениеПлатежа КАК НазначениеПлатежа,
//	|	энргПереносОплатыИсточник.Абонент КАК Абонент,
//	|	энргПереносОплатыИсточник.ЛицевойСчет КАК ЛицевойСчет,
//	|	&ПериодНачисления КАК ПериодНачисления
//	|ИЗ
//	|	Документ.энргПереносОплаты.Источник КАК энргПереносОплатыИсточник
//	|ГДЕ
//	|	энргПереносОплатыИсточник.Ссылка = &Ссылка";
//	Результат = Запрос.Выполнить();
//	Выборка		= Результат.Выбрать();
//	
//	Возврат Выборка;
//КонецФункции


Функция ПолучитьНовыеЗаписи()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Район", 				Район);
	Запрос.УстановитьПараметр("Период", 			?(ЗначениеЗаполнено(ДатаФактическогоСобытия), ДатаФактическогоСобытия, Дата));
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ПериодНачисления", 	ПериодНачисления);
	Запрос.Текст = "ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	&Район КАК Район,
	|	&Период КАК Период,
	|	энргПереносОплатыПриемник.ИсточникПоступления КАК ИсточникПоступления,
	|	энргПереносОплатыПриемник.НомерПлатежногоПоручения КАК НомерПлатежногоПоручения,
	|	энргПереносОплатыПриемник.ДатаПлатежногоПоручения КАК ДатаПлатежногоПоручения,
	|	энргПереносОплатыПриемник.СуммаОплаты КАК СуммаОплаты,
	|	энргПереносОплатыПриемник.ФИОПлательщика КАК ФИОПлательщика,
	|	энргПереносОплатыПриемник.НазначениеПлатежа КАК НазначениеПлатежа,
	|	энргПереносОплатыПриемник.Абонент КАК Абонент,
	|	энргПереносОплатыПриемник.ЛицевойСчет КАК ЛицевойСчет,
	|	&ПериодНачисления КАК ПериодНачисления
	|ИЗ
	|	Документ.энргПереносОплаты.Приемник КАК энргПереносОплатыПриемник
	|ГДЕ
	|	энргПереносОплатыПриемник.Ссылка = &Ссылка";
	Результат = Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	
	Возврат Выборка;	
КонецФункции

//Процедура ЗаписатьВРегистрэнргНераспознаннаяОплатаФизЛица(Таблица)
//	Пока Таблица.следующий() цикл
//		Запись 						= Движения.энргНераспознаннаяОплатаФизЛица.ДобавитьРасход();	
//		ЗаполнитьЗначенияСвойств(Запись,Таблица);
//	КонецЦикла;	
//КонецПроцедуры	

Процедура ЗаписатьНовыеЗаписиВРегистры(Таблица)
	Пока Таблица.следующий() цикл
		Запись 						= Движения.энргВзаиморасчеты.ДобавитьРасход();	
		ЗаполнитьЗначенияСвойств(Запись,Таблица);
		
		Запись 						= Движения.энргОплатаУслуг.Добавить();	
		ЗаполнитьЗначенияСвойств(Запись,Таблица);		
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
